nxp-mcuxpresso/mcux-devices-wireless/KW/KW43B43ZC3/gcc/startup_KW43B43ZC3.S
/*    Macro to define default handlers. Default handler
 *    will be weak symbol and just dead loops. They can be
 *    overwritten by other handlers */
    .macro def_irq_handler  handler_name
    .weak \handler_name
    .set  \handler_name, DefaultISR
    .endm

/* Exception Handlers */
    def_irq_handler    MemManage_Handler
    def_irq_handler    BusFault_Handler
    def_irq_handler    UsageFault_Handler
    def_irq_handler    SecureFault_Handler
    def_irq_handler    DebugMon_Handler
    def_irq_handler    CTI_IRQHandler
    def_irq_handler    CMC0_IRQHandler
    def_irq_handler    DMA0_DriverIRQHandler
    def_irq_handler    EWM0_IRQHandler
    def_irq_handler    MCM0_IRQHandler
    def_irq_handler    MSCM0_IRQHandler
    def_irq_handler    SYSCON0_IRQHandler
    def_irq_handler    SECCON0_IRQHandler
    def_irq_handler    SPC0_IRQHandler
    def_irq_handler    WUU0_IRQHandler
    def_irq_handler    WDOG0_IRQHandler
    def_irq_handler    WDOG1_IRQHandler
    def_irq_handler    CDOG0_IRQHandler
    def_irq_handler    CDOG1_IRQHandler
    def_irq_handler    SCG0_IRQHandler
    def_irq_handler    SFA0_DriverIRQHandler
    def_irq_handler    FMU0_IRQHandler
    def_irq_handler    SFA1_DriverIRQHandler
    def_irq_handler    DSB0_IRQHandler
    def_irq_handler    TRDC0_IRQHandler
    def_irq_handler    RTC_Alarm_IRQHandler
    def_irq_handler    RTC_Seconds_IRQHandler
    def_irq_handler    LPTMR0_IRQHandler
    def_irq_handler    LPTMR1_IRQHandler
    def_irq_handler    LPIT0_IRQHandler
    def_irq_handler    TPM_0_IRQHandler
    def_irq_handler    TPM_1_IRQHandler
    def_irq_handler    TPM_2_IRQHandler
    def_irq_handler    TPM_3_IRQHandler
    def_irq_handler    TPM_4_IRQHandler
    def_irq_handler    MU1_IRQHandler
    def_irq_handler    SYSCON0_ECC_IRQHandler
    def_irq_handler    LPI2C0_DriverIRQHandler
    def_irq_handler    LPI2C1_DriverIRQHandler
    def_irq_handler    LPSPI0_DriverIRQHandler
    def_irq_handler    LPSPI1_DriverIRQHandler
    def_irq_handler    LPSPI2_DriverIRQHandler
    def_irq_handler    LPUART0_DriverIRQHandler
    def_irq_handler    LPUART1_DriverIRQHandler
    def_irq_handler    CAN0_DriverIRQHandler
    def_irq_handler    RF_ZIGBEE_IRQHandler
    def_irq_handler    RF_Generic_IRQHandler
    def_irq_handler    RF_BRIC_IRQHandler
    def_irq_handler    RF_LCL_IRQHandler
    def_irq_handler    RF_WOR_IRQHandler
    def_irq_handler    RFMC_IRQHandler
    def_irq_handler    Reserved77_IRQHandler
    def_irq_handler    Reserved78_IRQHandler
    def_irq_handler    COEX_INT_IRQHandler
    def_irq_handler    Reserved80_IRQHandler
    def_irq_handler    GPIOA_INT0_IRQHandler
    def_irq_handler    GPIOA_INT1_IRQHandler
    def_irq_handler    GPIOB_INT0_IRQHandler
    def_irq_handler    GPIOB_INT1_IRQHandler
    def_irq_handler    GPIOC_INT0_IRQHandler
    def_irq_handler    GPIOC_INT1_IRQHandler
    def_irq_handler    GPIOD_INT0_IRQHandler
    def_irq_handler    GPIOD_INT1_IRQHandler
    def_irq_handler    Reserved89_IRQHandler
    def_irq_handler    Reserved90_IRQHandler
    def_irq_handler    Reserved91_IRQHandler
    def_irq_handler    Reserved92_IRQHandler
    def_irq_handler    ADC0_IRQHandler
    def_irq_handler    CMP0_IRQHandler
    def_irq_handler    FLEXPWM0_SUBMODULE0_CMP_IRQHandler
    def_irq_handler    FLEXPWM0_SUBMODULE0_CAP_IRQHandler
    def_irq_handler    FLEXPWM0_SUBMODULE0_RELOAD_IRQHandler
    def_irq_handler    FLEXPWM0_SUBMODULE1_CMP_IRQHandler
    def_irq_handler    FLEXPWM0_SUBMODULE1_CAP_IRQHandler
    def_irq_handler    FLEXPWM0_SUBMODULE1_RELOAD_IRQHandler
    def_irq_handler    FLEXPWM0_SUBMODULE2_CMP_IRQHandler
    def_irq_handler    FLEXPWM0_SUBMODULE2_CAP_IRQHandler
    def_irq_handler    FLEXPWM0_SUBMODULE2_RELOAD_IRQHandler
    def_irq_handler    FLEXPWM0_RELOAD_ERROR_IRQHandler
    def_irq_handler    FLEXPWM0_FAULT_IRQHandler
    def_irq_handler    ITRC_DriverIRQHandler
    def_irq_handler    TDET_IRQHandler
    def_irq_handler    MU0_IRQHandler
    def_irq_handler    INTM_IRQHandler
    def_irq_handler    SGI_IRQHandler
    def_irq_handler    SECURE_ERR_IRQHandler
    def_irq_handler    PKC_IRQHandler
    def_irq_handler    TRNG0_IRQHandler
    def_irq_handler    FLASH_Arbiter_IRQHandler
    def_irq_handler    BLE_INT0_IRQHandler
    def_irq_handler    BLE_INT1_IRQHandler
    def_irq_handler    BLE_INT2_IRQHandler
    def_irq_handler    BRF_INT_IRQHandler
    def_irq_handler    T1_INT_IRQHandler
    def_irq_handler    T2_INT_IRQHandler
    def_irq_handler    T3_INT_IRQHandler
    def_irq_handler    T4_INT_IRQHandler
    def_irq_handler    WDG1_IRQHandler
    def_irq_handler    OSC_32M_READY_IRQHandler
    def_irq_handler    RBME_INT_IRQHandler
    def_irq_handler    RSM_INT_IRQHandler
    def_irq_handler    PLL_ABORT_INT_IRQHandler
    def_irq_handler    DMA_LIGHT_DriverIRQHandler

    .end
